package Chapter9;
//Г Л А В А 9 Строки символов

//        1. Для чего используются величины, представляющие собой символьные строки?
//        Как они описываются?
//        2. Как можно задать значение величине, представляющей собой символьную строку?
//        3. Какие операции можно выполнять над символьными строками?
//        4. Укажите стандартные функции и процедуры для работы с символьными строками.
//        5. Опишите, что представляет собой таблица ASCII.
//        6. Строку символов часто называют динамическим массивом. Объясните почему.

public class Chapter9 {
}
