package Chapter11;

//11.58. Известны данные о количестве осадков, выпавших за каждый месяц года.
//        Найти общее число осадков, выпавших в марте, июне, сентябре и декабре.
public class Ex11_58 {
    public static void main(String[] args) {
        int[] ar = {2, 3, 4, 3, 2, 3, 4, 5, 6, 5, 4, 3};
        System.out.println(ar[2]+ar[5]+ar[11]);

    }
}
